IDEA Open Model
ReportSettings Class
Compatible with IDEA StatiCa 20.1
 Report settings for IDEA connections.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ReportSettings
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ReportSettings
Public Class ReportSettings
The ReportSettings type exposes the following members.
Constructors
Name | Description
ReportSettings
Initializes a new instance of the ReportSettings class
Top
Properties
Name | Description
CultureName
 The name of the required culture of the report
Formulas
 Indicates if formulas are in report
PlatesDrawings
 Indicates, whether generate drawing of plates.
ReportType
 Gets or sets the type of report.
ResultsPictures
 Indicates, whether generate pictures of results.
SymbolExplanations
 Indicates, whether generate explanations to report.
TheoreticalBackground
 Indicates, whether generate theoretical background.
Unit
 The name of the required culture of the report
Views
 Indicates, whether generate views (XY, XZ, YZ) into report.
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace